Often dataframes are not in the exact same order or format, meaning that we can't simply just glue them or concatenate them together.

__`pd.merge()`__

The pd.merge() method takes in a key argument labeled __how__.
<br>
There are 3 main ways of merging tables together using the __how__ parameter:
 - Inner
 - Outer 
 - Left or Right

The main idea behind the argument is to decide __how__ to deal with information only present in one of the joined tables.

___

For the sake of simplicity here, we're going to assume that names are unique.

__<u>So when we're dealing with pandas and performing a merge method call,</u>__
 - First we need to decide __on__ what column to merge together.
    So there's basically two rules here:
     - the __on__ column should be a _primary_ identifier, meaning unique per row.
     - the __on__ column should also be present in both tables being merged and it should essentially represent the same thing on both tables.
     
     
 - Next we need to decide __how__ to merge the tables __on__ the name column (our example).
     - With __how='inner'__ the result will be the set of records that __match in both tables__.

In [2]:
from PIL import Image

In [3]:
img = Image.open('20220414_162436.jpg')
img.show()

___

In [6]:
import numpy as np
import pandas as pd

In [7]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [8]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [9]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [10]:
pd.merge(registrations, logins, on='name', how='inner')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

What's actually happening is you're only taking things that are present in both tables.

In [1]:
# inner merge - we take values that are present in both tables